In [1]:
import pandas as pd
import numpy as np

In [20]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),pd.NaT]
                   })

In [9]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [10]:
df.dropna() # Drop the rows where at least one element is missing.

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [11]:
df.dropna(axis=1) # Drop the columns where at least one element is missing.

       name
0    Alfred
1    Batman
2  Catwoman

In [12]:
df.dropna(how='all') # Drop the rows where all elements are missing.

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [13]:
df.dropna(thresh=2) # Drop the rows where at least 2 elements are missing.

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [ ]:
df.dropna(subset=['name', 'toy']) # Drop the rows where 'age' is missing.
# We can also use the subset parameter to specify which columns to check for missing values.

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [15]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [16]:
# I performed lots of dropna operations but still at the end I have the same DataFrame in the 'df'. 
# The dropna method returns a new DataFrame and does not modify the original DataFrame.
# To modify the original DataFrame, we can use the inplace parameter.

df.dropna(inplace=True) # Drop the rows where at least one element is missing.
df
# Now the DataFrame is modified and the rows with missing values are dropped.
# Note that the original DataFrame is modified and the rows with missing values are dropped.

     name        toy       born
1  Batman  Batmobile 1940-04-25

## Drop Duplicates

In [22]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),pd.NaT]
                   })

In [23]:
# Drop Duplicates Return DataFrame with duplicate rows removed.
df.drop_duplicates(subset=["name"], keep=False) # Drop the rows where 'name' is duplicated.

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [24]:
df.drop_duplicates(subset=["name"], keep='first') # Drop the rows where 'name' is duplicated. The keep parameter specifies which duplicates to keep.

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

### Note: I cannot give axis as a parameter to the drop_duplicates function. As it only takes subset as an arguement, not axis